In [6]:
import pandas as pd

df = pd.read_csv("titanic.csv")

df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [20]:
df["age"].notnull().value_counts() # Nombre de personnes ou l'age est présente et celle ou elle est nul

True     1046
False     263
Name: age, dtype: int64

In [24]:
df.groupby("survived").size() # Nombre de personnes qui ont survécu

survived
0    809
1    500
dtype: int64

In [35]:
df[df["survived"] == 1]["age"].mean() # Age moyen des survivant

28.918228103044495

In [36]:
df[df["survived"] == 1]["fare"].mean() # Prix moyen du ticket pour les survivants

49.361183600000004

In [37]:
df.groupby("survived")["age"].mean() # Comparatif de la moyen d'age entre les survivants et les morts

survived
0    30.545369
1    28.918228
Name: age, dtype: float64

In [53]:
df.groupby(["survived","sex"]).size() # Comparatif de nombre de femme/homme qui ont survécu

survived  sex
0         female    127
          male      682
1         female    339
          male      161
dtype: int64

In [55]:
df.groupby(["survived"])["sex", "age", "pclass"].count() # Nombre de personne qui ont survécu ou non par rapport à certain attribut

          sex  age  pclass
survived
0         809  619     809
1         500  427     500

In [61]:
df["age"].fillna(999)

0        29.0000
1         0.9167
2         2.0000
3        30.0000
4        25.0000
5        48.0000
6        63.0000
7        39.0000
8        53.0000
9        71.0000
10       47.0000
11       18.0000
12       24.0000
13       26.0000
14       80.0000
15      999.0000
16       24.0000
17       50.0000
18       32.0000
19       36.0000
20       37.0000
21       47.0000
22       26.0000
23       42.0000
24       29.0000
25       25.0000
26       25.0000
27       19.0000
28       35.0000
29       28.0000
          ...
1279     14.0000
1280     22.0000
1281     22.0000
1282    999.0000
1283    999.0000
1284    999.0000
1285     32.5000
1286     38.0000
1287     51.0000
1288     18.0000
1289     21.0000
1290     47.0000
1291    999.0000
1292    999.0000
1293    999.0000
1294     28.5000
1295     21.0000
1296     27.0000
1297    999.0000
1298     36.0000
1299     27.0000
1300     15.0000
1301     45.5000
1302    999.0000
1303    999.0000
1304     14.5000
1305    999.0000
1306     26.5000
1307     27.0000
1308     29.0000
Name: age, Length: 1309, dtype: float64